Revit 2024 API
DefinitionGroups.Contains Method
Tests for the existence of a definition group within the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Contains(
	DefinitionGroup definitionGroup
)
Visual Basic
Public Function Contains ( _
	definitionGroup As DefinitionGroup _
) As Boolean
Visual C++
public:
bool Contains(
	DefinitionGroup^ definitionGroup
)
Parameters
definitionGroup
Type: Autodesk.Revit.DB.DefinitionGroup
The definition group to look for.
Return Value
True if the definition group was found, false otherwise.
See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace